## Linear_regression_multiple_variables

### Excercise

The file (__hiring.csv__) contains hiring statistics for a firm such as experience of candidate, his written test score and personal interview score. Based on these 3 factors. HR will decide the salary. Given this data, you need to build a machine learning model for HR department that can help them decide salaries for future candidates. Using this predict salaries for the followig candidates.

__2 yr experience, 9 test score, 6 interview score__

__12 yr experience, 10 test score, 10 interview score__

In [5]:
# import libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn import linear_model
from word2number import w2n

In [16]:
# read in the data
df = pd.read_csv("hiring.csv")
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [17]:
# Filling the missing values in experience with "0"
df.experience.fillna("0", inplace=True)

In [12]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0          0                    8.0                           9      50000
1          0                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [18]:
# Convert the experience column in text to numbers using the Word2number library
df.experience = df.experience.apply(lambda x: w2n.word_to_num(x))

In [19]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    NaN                           7      72000
7          11                    7.0                           8      80000

In [22]:
# fill the missing value in the test_score
df["test_score(out of 10)"].fillna(df["test_score(out of 10)"].median(), inplace=True)

In [23]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    8.0                           7      72000
7          11                    7.0                           8      80000

In [24]:
# Instantiating the linear regression model and giving it independent variables and dependent variables
reg = linear_model.LinearRegression()
reg.fit(df[["experience", "test_score(out of 10)", "interview_score(out of 10)"]], df["salary($)"])

LinearRegression()

In [25]:
# checking the coefficient of the model
reg.coef_

array([2812.95487627, 1845.70596798, 2205.24017467])

In [26]:
# checking the intercept of the model
reg.intercept_

17737.263464337688

In [35]:
# predict for 2 yr experience, 9 test score, 6 interview score
reg.predict([[2, 9, 6]])

C:\Users\TEMITOPE\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([53205.96797671])

In [36]:
# predict for 12 yr experience, 10 test score, 10 interview score
reg.predict([[12, 10, 10]])

C:\Users\TEMITOPE\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([92002.18340611])